Q1. List any five functions of the pandas library with execution.

Below are five functions of the pandas library with example executions:

The DataFrame() function creates a pandas DataFrame, which is a 2-dimensional labeled data structure with columns of potentially different types. The DataFrame can be created from a variety of sources, such as a dictionary, a NumPy array, or a CSV file.

In [3]:
import pandas as pd

data = {"Name": ["A", "B", "C"], "Age": [15, 20, 25]}
df = pd.DataFrame(data)
df

  Name  Age
0    A   15
1    B   20
2    C   25

describe(): The describe() function generates descriptive statistics of a pandas DataFrame, such as count, mean, standard deviation, and more. This function is useful for quickly understanding the distribution and range of values in a dataset.m

In [4]:
df.describe()

        Age
count   3.0
mean   20.0
std     5.0
min    15.0
25%    17.5
50%    20.0
75%    22.5
max    25.0

pivot_table(): This function is used to create a spreadsheet-style pivot table based on a Pandas DataFrame, which is useful for summarizing and aggregating data.

In [6]:
import pandas as pd

# Creating a DataFrame
data = {"Name": ["Alice", "Bob", "Charlie", "David", "Ella", "Frank"],
        "Sex": ["F", "M", "M", "M", "F", "M"],
        "Age": [25, 30, 35, 40, 25, 30],
        "Salary": [50000, 60000, 70000, 80000, 55000, 65000]}
df = pd.DataFrame(data)

# Creating a pivot table
pivot_df = pd.pivot_table(df, index=["Sex", "Age"], values="Salary", aggfunc="mean")

pivot_df

         Salary
Sex Age
F   25    52500
M   30    62500
    35    70000
    40    80000

4)merge(): The merge() function merges two pandas DataFrames based on one or more common columns. This function is useful for combining data from multiple sources based on a shared key.

In [7]:
import pandas as pd

# Creating two DataFrames
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "Age": [25, 30]})
df2 = pd.DataFrame({"Name": ["Bob", "Charlie"], "Salary": [50000, 60000]})

# Merging two DataFrames based on a common column
merged_df = pd.merge(df1, df2, on="Name")
merged_df

  Name  Age  Salary
0  Bob   30   50000

5)apply(): The apply() function applies a given function to each element of a pandas DataFrame or Series. This function is useful for transforming data in a DataFrame or Series according to a specified operation.

In [8]:
import pandas as pd

# Creating a DataFrame
data = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 30, 35]}
df = pd.DataFrame(data)

# Defining a function to add 10 to each age
def add_10(age):
    return age + 10

# Applying the function to the "Age" column of the DataFrame
df["Age"] = df["Age"].apply(add_10)
df

      Name  Age
0    Alice   35
1      Bob   40
2  Charlie   45

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.m

In [9]:
import pandas as pd

# Re-indexing the DataFrame using the reindex_df() function
def reindex_df(df):
    new_index = range(1, 2*len(df)+1, 2)
    df = df.set_index(pd.Index(new_index))
    return df

#Driver Code
# Creating a sample DataFrame
df = pd.DataFrame({'A': [10, 20, 30, 40],
                   'B': [50, 60, 70, 80],
                   'C': [90, 100, 110, 120]})
df = reindex_df(df)
print(df)

    A   B    C
1  10  50   90
3  20  60  100
5  30  70  110
7  40  80  120

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. Thefunction should print the sum to the console.For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function shouldcalculate and print the sum of the first three values, which is 60.

In [11]:
import pandas as pd

#Functin for priting the sum
def sum_first_three_values(df):
    values_col = df['Values']
    first_three_values = values_col.iloc[:3]
    sum_first_three = sum(first_three_values)
    print(f"The sum of the first three values in the 'Values' column is {sum_first_three}.")
    
#Driver Code
# Creating a sample DataFrame
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})

# Calculating the sum of the first three values in the 'Values' column using the sum_first_three_values() function
sum_first_three_values(df)

The sum of the first three values in the 'Values' column is 60.

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [13]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({'Text': ['This is a sample text.', 'Another text with more words.', 'A third text.']})

# Function to count the number of words in a given text
def count_words(text):
    return len(text.split())

# Apply the function to each row of the 'Text' column and create a new column 'Word_Count'
df['Word_Count'] = df['Text'].apply(lambda x: count_words(x))

# Print the DataFrame
print(df)

                            Text  Word_Count
0         This is a sample text.           5
1  Another text with more words.           5
2                  A third text.           3

Q5. How are DataFrame.size() and DataFrame.shape() different?

The DataFrame.size() and DataFrame.shape() functions in Pandas are different in the following ways:

DataFrame.size() returns the total number of elements in the DataFrame, which is equal to the product of the number of rows and columns, i.e., DataFrame.size() = DataFrame.shape[0] * DataFrame.shape[1].
DataFrame.shape() returns a tuple of two integers representing the dimensions of the DataFrame, where the first integer represents the number of rows and the second integer represents the number of columns.
In summary, DataFrame.size() returns the total number of elements in the DataFrame, while DataFrame.shape() returns a tuple representing the dimensions of the DataFrame.

Q6. Which function of pandas do we use to read an excel file?

The pandas library provides the read_excel() function to read an Excel file. The read_excel() function can read Excel files with various file extensions, including .xls, .xlsx, .xlsm, .xlsb, etc. Here's an example of how to use the read_excel() function to read an Excel file:

In [ ]:
import pandas as pd

# Read an Excel file into a DataFrame
df = pd.read_excel('example.xlsx')

#In the above code, the read_excel() function reads the Excel file named example.xlsx and returns a DataFrame.
#You can specify additional parameters to the read_excel() function to customize how the file is read, such as the sheet name, column names, data types, etc.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [15]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({'Email': ['herilshah@xyz.com', 'heril.shah@xyz.com', 'heril.shah1@xyz.com']})

# Function to extract the username from an email address
def extract_username(email):
    return email.split('@')[0]

# Apply the function to each row of the 'Email' column and create a new column 'Username'
df['Username'] = df['Email'].apply(lambda x: extract_username(x))

# Print the DataFrame
print(df)

                 Email     Username
0    herilshah@xyz.com    herilshah
1   heril.shah@xyz.com   heril.shah
2  heril.shah1@xyz.com  heril.shah1

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
   A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2                                                                                                                                                 
Your function should select the following rows:                                                                                      
   A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [19]:
data = [[ 3, 5, 1],[8, 2, 7],[6, 9, 4],[2, 3, 5],[9, 1, 2]]
df = pd.DataFrame(data, columns = ['A','B','C'])
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [20]:
new_df = df[(df['A'] > 5)  & (df['B'] < 10 )]
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [21]:
df = pd.DataFrame({'Values': [2,3,4,5,6,7,8]})
df

   Values
0       2
1       3
2       4
3       5
4       6
5       7
6       8

In [22]:
df.describe() #All

         Values
count  7.000000
mean   5.000000
std    2.160247
min    2.000000
25%    3.500000
50%    5.000000
75%    6.500000
max    8.000000

In [23]:
df.mean()

Values    5.0
dtype: float64

In [24]:
df.median()

Values    5.0
dtype: float64

In [25]:
df.std()

Values    2.160247
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'Moving Average' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [20]:
import numpy as np
import pandas as pd

In [21]:
df = pd.DataFrame(pd.date_range(start='2023-02-10' , end = '2023-02-26'), columns = ['Date'])
df['Sales'] = np.random.randint(100,1000,size=(17))
df[['Sales','Date']]

    Sales       Date
0     409 2023-02-10
1     612 2023-02-11
2     366 2023-02-12
3     791 2023-02-13
4     927 2023-02-14
5     462 2023-02-15
6     783 2023-02-16
7     549 2023-02-17
8     884 2023-02-18
9     682 2023-02-19
10    200 2023-02-20
11    231 2023-02-21
12    274 2023-02-22
13    536 2023-02-23
14    520 2023-02-24
15    849 2023-02-25
16    748 2023-02-26


Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
O 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

Your function should create the following DataFrame:
Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday

The function should return the modified DataFrame.

In [22]:
date = pd.date_range(start='2023-01-01' , end = '2023-01-05')
df = pd.DataFrame({'Date':date})
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [23]:
df['Weekday'] = df['Date'].dt.day_name()
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'

In [25]:
data = pd.date_range(start='2022-12-01', end='2023-02-28')
df_date = pd.DataFrame(data, columns=['Date'])
df_date

         Date
0  2022-12-01
1  2022-12-02
2  2022-12-03
3  2022-12-04
4  2022-12-05
..        ...
85 2023-02-24
86 2023-02-25
87 2023-02-26
88 2023-02-27
89 2023-02-28

[90 rows x 1 columns]

In [26]:
start = '2023-01-01'
end =  '2023-01-31'
mask = (df['Date'] > start) & (df['Date'] < end)
df.loc[mask]

        Date    Weekday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [ ]:
import pandas as pd

In [28]:
#The Pandas Library